app/views/posts/show.html.erb

    <div class="container">
        <h2 class="subtitle is-5"><strong><%= @post.comments.count %> Comments </strong></h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]