app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "Long"], ["comment", "first comment"], ["created_at", "2021-12-11 15:16:04.858421"], ["updated_at", "2021-12-11 15:16:04.858421"], ["post_id", 1]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = Comment.new
        @comment = @post.comments.create(params[:comment].permit(:user_id,:name, :comment ))