app/controllers/posts_controller.rb

    def index
        @post = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "test update"], ["updated_at", "2021-12-11 13:23:23.066486"], ["id", 2]]